//დაწერეთ პროგრამა რომელიც კონსოლში გამოპრინტავს რიცხვებს 0 დან 10-ის ჩათვლით. გამოიყენეთ while და for ციკლები.
// for(let i = 0; i <= 10; i++){
//     console.log(i)
// }

// let num = 0;

// while(num <= 10){
//     console.log(num)
//     num +=1
// }

// დაწერეთ პროგრამა, რომელიც ბეჭდავს ლუწ რიცხვებს 1-დან 20-მდე for loop-ის გამოყენებით.
// for (let i = 2 ; i <= 20; i += 2){
//     console.log(i)
// }

// დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს რიცხვი და დაბეჭდოს "Hello!" იმდენჯერ რამდენსაც უდრის ეს შეყვანილი რიცხვი.
// const num = Number(prompt("enter number: "));

// for (let i = 0; i < num; i++){
//     console.log("hello")
// }

// დაწერეთ პროგრამა, რომელიც გამოთვლის რიცხვების ჯამს 1-დან 100-მდე for loop-ის გამოყენებით და დაბეჭდავს შედეგს.
// let sum=0;
// for(let i = 1; i <= 100; i++){
//      sum += i;
// }
// console.log(sum);

// დაწერეთ პროგრამა, რომელიც გამოთვლის კენტი რიცხვების ჯამს 1-დან 100-მდე და დაბეჭდავს შედეგს.

// let sum = 0;

// for(let i = 1; i <= 100; i+= 2){
//     sum += i
// }

// console.log(sum)

// დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს გამოიცნოს საიდუმლო რიცხვი 1-დან 10-მდე. განაგრძეთ გამოცნობის მოთხოვნა, სანამ ისინი სწორად გამოიცნობენ, while loop-ის გამოყენებით.

const magicNum = Math.floor(Math.random() * 10) + 1;

let num;

do {
  num = +prompt("write number: ");
} while (num !== magicNum);
{
  console.log(num);
}
